{
  "posts": [
    { "id": 1, "title": "Post 1" },
    { "id": 2, "title": "Post 2" },
    { "id": 3, "title": "Post 3" }
  ],
  "comments": [
    { "id": 1, "body": "some comment", "postId": 1 },
    { "id": 2, "body": "some comment", "postId": 1 }
  ],
  "profile": {
    "name": "typicode"
  },
  "foods": [
    {
      "id": 1,
      "food_recipe_code": "f1QVOa9hTv",
      "title": "Sate Ayam Bali",
      "description": "Sate Ayam Bali adalah hidangan sate yang terbuat dari potongan daging ayam yang disate dan dipanggang dengan bumbu khas Bali yang kaya akan rempah-rempah.",
      "images": "https://th.bing.com/th/id/OIP.r1zbdGaDq0WBiRfxIVutMwAAAA?pid=ImgDet&w=189&h=236&c=7&dpr=1,4",
      "ingredients": " 500 gram daging ayam fillet, potong dadu, Bumbu marinasi:, 3 sdm kecap manis, 2 sdm minyak goreng, 1 sdm air jeruk nipis, 2 siung bawang putih, parut, 1 cm jahe, parut, 1 sdt garam, 1/2 sdt merica bubuk, Tusuk sate secukupnya, Bumbu sate Bali:, 5 butir bawang merah, 3 siung bawang putih, 3 buah cabai merah, 2 cm kunyit, 2 cm jahe, 2 cm lengkuas, 2 sdm terasi bakar, 2 sdm gula merah, 1 sdt garam, 1/2 sdt merica bubuk, 2 sdm minyak goreng.",
      "instructions": "Campur semua bahan marinasi dalam mangkuk besar dan aduk rata. Tambahkan potongan daging ayam fillet ke dalam marinasi dan diamkan dalam lemari es selama minimal 2 jam atau semalam untuk hasil yang lebih baik. Tusuk potongan ayam ke tusuk sate. Panaskan panggangan atau grill dan panggang sate ayam hingga matang dan berwarna kecokelatan. Sementara itu, haluskan semua bahan bumbu sate Bali dan tumis hingga harum. Sajikan sate ayam panas dengan bumbu sate Bali dan nasi putih hangat.",
      "servings": 4,
      "prep_time": 120,
      "cook_time": 15,
      "total_time": 135,
      "created_at": "2024-02-15T13:25:06.701Z",
      "updated_at": "2024-02-15T13:25:06.701Z"
    },
    {
      "id": 2,
      "food_recipe_code": "cpxNl8bXe4",
      "title": "Ayam Betutu Bali",
      "description": "Ayam Betutu adalah hidangan khas Bali yang terbuat dari ayam yang dibumbui dengan rempah-rempah khas Bali dan kemudian dipanggang atau direbus hingga matang.",
      "images": "https://www.bing.com/images/search?view=detailV2&ccid=l9r9pRxH&id=979EA0CA4ECDEE097AB54D12AA2E8AD358169227&thid=OIP.l9r9pRxHmpkOWJ-fUiHCyQHaFj&mediaurl=https%3A%2F%2Fdiscovercorps.com%2Fwp-content%2Fuploads%2F2017%2F08%2FAyam-Betutu-Khas-Bali-2-640x480.jpg&exph=480&expw=640&q=ayam+betutu+bali&form=IRPRST&ck=DC08523058231CEFAA84E7D0B47EDE65&selectedindex=0&itb=0&ajaxhist=0&ajaxserp=0&vt=2",
      "ingredients": "1 ekor ayam kampung, potong menjadi bagian kecil, 10 lembar daun pisang untuk membungkus, 10 lembar daun salam, 5 batang serai, memarkan 5 lembar daun jeruk purut, 500 ml santan kental, 200 ml air Garam secukupnya.",
      "instructions": "1. Campurkan ayam potong dengan bumbu betutu (bumbu khas Bali) hingga merata. 2. Siapkan daun pisang, letakkan daun salam, serai, dan daun jeruk purut di atasnya. 3. Letakkan potongan ayam yang telah dibumbui di atas daun-daun tersebut. 4. Tuangkan santan dan air ke dalam bungkusan daun pisang. 5. Bungkus rapat-rapat dan kukus atau panggang selama 2-3 jam hingga ayam betutu matang dan rempahnya meresap. 6. Sajikan ayam betutu dengan nasi putih hangat.",
      "servings": 4,
      "prep_time": 30,
      "cook_time": 180,
      "total_time": 210,
      "created_at": "2024-02-16T12:20:24.699Z",
      "updated_at": "2024-02-16T12:20:24.699Z"
    }
  ]
}
